{
    "companyProfile": {
      "name": "Melexis NV",
      "ticker": "MELE",
      "exchange": "Euronext Brussels",
      "headquarters": "Ieper, Belgium",
      "founded": 1988,
      "sector": "Technology / Semiconductors",
      "businessDescription": "Melexis NV is a global micro-electronic semiconductor company specializing in the design, development, testing, and marketing of advanced integrated circuits (ICs), with a focus on sensor technologies for the automotive industry, which accounts for approximately 90% of its revenue. The company operates on a 'fabless' model, outsourcing wafer fabrication while concentrating on R&D, design, and testing. Its products are also used in alternative mobility, smart appliances, robotics, and digital health.",
      "financials": {
        "revenue2024": "932.8 million EUR",
        "marketCapAug2025": "3.21 billion USD"
      },
      "globalFootprint": [
        {
          "region": "EMEA",
          "locations": "Belgium, Bulgaria, France, Germany, Ireland, Switzerland, Ukraine"
        },
        {
          "region": "APAC",
          "locations": "China, Japan, Malaysia, Philippines, South Korea"
        },
        {
          "region": "Americas",
          "locations": "USA"
        }
      ]
    },
    "esgAssessmentSummary": {
      "finalRiskCategory": "2 - High Risk",
      "executiveSummary": "Melexis NV presents a bifurcated risk profile. The company demonstrates strong corporate governance, environmental policies, and a commendable ethical stance regarding Russia's war against Ukraine. However, a significant and unmitigated risk exists from the indirect contribution of its dual-use semiconductor products to the Israeli-Palestinian conflict. These components are sold into Israel via global distributors, making it highly probable they are used in military systems by the Israel Defense Forces. The company's reliance on a distribution model without end-user traceability renders its policies against military end-use ineffective from an ethical risk perspective, leading to the high-risk categorization.",
      "summaryRiskTable": [
        {
          "criterion": "§ 4a & 4b - Serious Violations of Human Rights & Humanitarian Law",
          "riskLevel": "High"
        }
      ]
    },
    "detailedRiskAnalysis": [
      {
        "criterion": "§ 4a & 4b - Serious Violations of Human Rights & Humanitarian Law",
        "riskLevel": "High",
        "findings": "The company's products are critical enablers for military technology used by the Israel Defense Forces in a conflict marked by severe violations of international humanitarian law. While Melexis is not directly involved, its failure to implement a robust end-user verification system for its dual-use products constitutes a significant ethical lapse, creating an unacceptable risk of contributing to these violations."
      },
      {
        "criterion": "§ 4c & 4d - Sale of Weapons to Certain States",
        "riskLevel": "Moderate",
        "findings": "Melexis does not directly sell weapons. However, the sale of critical, enabling dual-use components to a state engaged in armed conflict (Israel) can be interpreted as a material contribution to that state's military capabilities. This creates a moderate risk of contravening the spirit and intent of these criteria."
      },
      {
        "criterion": "§ 4e & 4f - Severe Environmental Damage & Unacceptable Greenhouse Gas Emissions",
        "riskLevel": "Low",
        "findings": "The company demonstrates a strong and proactive approach to environmental management. It holds ISO 14001 certification and has set an ambitious target to reduce Scope 1 and 2 GHG emissions per million sold ICs by 55% by 2030 (vs. 2024 baseline). Its fabless model contributes to a low direct environmental impact. The risk under this criterion is low."
      },
      {
        "criterion": "§ 4g & 4h - Gross Corruption & Other Particularly Serious Violations",
        "riskLevel": "Low",
        "findings": "Melexis maintains a robust anti-corruption framework, including a confidential 'Speak Up' whistleblowing channel. A review of its history shows no evidence of involvement in gross corruption or bribery. Past patent litigation does not meet the threshold for a serious violation of ethical norms. The risk is assessed as low."
      }
    ],
    "productAnalysis": {
      "portfolioOverview": "Melexis's product portfolio consists of advanced mixed-signal semiconductor solutions that are critical enabling components for complex electronic systems. The main categories are: Sensors (magnetic, pressure, optical, temperature), Drivers (for motors and LEDs), and Transceivers (for system communication like LIN and CAN).",
      "dualUseNature": "Semiconductors are a quintessential dual-use technology. Melexis's high-precision sensors are essential for guidance, navigation, and targeting systems in military hardware such as UAVs (drones), precision-guided munitions, and robotics. Many of these items are explicitly listed under multilateral export control regimes like the Wassenaar Arrangement, confirming their strategic military importance.",
      "productBasedExclusionAnalysis": "An analysis against the GPFG's product-based criteria (§ 3) shows no grounds for exclusion. Melexis is not involved in the production of prohibited weapons, tobacco, cannabis, or thermal coal. All ethical risks derive from the company's conduct and the end-use of its products."
    },
    "geopoliticalExposure": {
      "russiaUkraineConflict": {
        "stance": "Proactive, values-aligned",
        "actions": "Melexis has maintained its R&D center in Kyiv, Ukraine, throughout the conflict, earning a 'Bravery Award' from the European Business Association. The company has no official presence or sanctioned business activities in the Russian Federation. This conduct is a strong positive ethical signal."
      },
      "israeliPalestinianConflict": {
        "stance": "Passive, legally defensive",
        "actions": "The company relies on legal disclaimers in its terms and conditions to mitigate liability, while continuing to sell products into the region via a business model that makes military end-use a high-probability outcome. This inaction and failure to implement enhanced due diligence is a strong negative ethical signal."
      },
      "inconsistentEthicalPostureAnalysis": "The company's proactive, values-aligned stance on Ukraine contrasts sharply with its passive, legally defensive posture regarding the Israeli-Palestinian conflict. This suggests that ethical decision-making may be driven more by compliance with the geopolitical alignment of its primary markets (EU/US) and legal liability minimization, rather than a universally applied set of ethical principles. This inconsistency represents a significant governance risk."
    },
    "assessmentMetadata": {
      "reportTitle": "Comprehensive Risk Assessment of Melexis NV for the Government Pension Fund Global",
      "assessmentDate": "2025-08-15",
      "assessedBy": "Gemini Deep Research",
      "guidelineReference": "https://lovdata.no/dokument/INS/forskrift/2014-12-18-1793"
    }
  }